<a href="https://colab.research.google.com/github/Diogo-code/Data-Mining-Diogo/blob/main/Examples_Data_Transformation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

HousingData = pd.read_csv('/content/melb_data.csv')

HousingData['Date'] = pd.to_datetime(HousingData['Date'])

HousingData['Propertycount'] = HousingData['Propertycount'].astype('int')

#TypeMap =  {'h':'house', 'u':'unit', 't':'town_house'}

TypeMap = {HousingData.Type.unique()[0]:'house', HousingData.Type.unique()[1]:'unit', HousingData.Type.unique()[2]:'town_house'}

HousingData.Type.replace(TypeMap, inplace=True)

HousingData['Type']=HousingData['Type'].astype('category')

#print(HousingData.Type.memory_usage())

HousingData['Month'] = HousingData['Date'].dt.month

HousingData['Weekday'] = HousingData['Date'].dt.weekday

HousingData.Address.str.upper().sample(10)

8727         12A DOYLE ST
7626     235 NICHOLSON ST
6609       70 TARCOOLA DR
11016         10 BAIRD ST
5515         32 WALTER ST
13286    11 GRENVILLE TCE
3770         14 HOWARD ST
4952          70 BRUCE ST
6027         8 HASSETT ST
10317      328 BARKERS RD
Name: Address, dtype: object

In [ ]:
import pandas as pd
import numpy as np
from datetime import date

MarketingData=pd.read_csv('/content/marketing_data.csv')

MarketingData['Age']= date.today().year - MarketingData['Year_Birth']

MarketingData['Year'] = pd.DatetimeIndex(MarketingData['Dt_Customer']).year

MarketingData['Enrollment_Length'] = date.today().year - MarketingData['Year']

MarketingData[' Income '] = MarketingData[' Income '].str.replace(',', '').str.replace('$', '').str.replace('.', '').fillna(0).astype(int)

MarketingData['Income_M$'] = MarketingData[' Income '].apply(lambda x: round(x/1000000, 2))

MarketingData[[' Income ', 'Income_M$']].describe()

            Income     Income_M$
count  2.240000e+03  2240.000000
mean   5.168746e+06     5.168737
std    2.560934e+06     2.560927
min    0.000000e+00     0.000000
25%    3.472200e+06     3.470000
50%    5.107500e+06     5.105000
75%    6.828975e+06     6.830000
max    6.666660e+07    66.670000